<template>
  <div>
    <h3>Задание 3</h3>
    <h4>Продумать опросник на произвольно выбранную тематику, состоящий из семи вопросов. Все вопросы одного толка: «Наладить соответствие». В каждом вопросе предлагаются четыре термина в одном столбце, а также четыре, пять, шесть или семь определений в другом. В качестве активных элементов управления использовать текстовые поля. Соответствие налаживается постановкой одинаковых числовых значений напротив термина и относящегося к нему определения. Вопросы задаются сразу все. По итогам нажатия на кнопку «Выполнено» выдавать результат успеха прохождения опроса в процентах. Подсчёт: все термины в вопросе определены верно – 1 балл. Если не все термины определены верно, то: за 1 термин – 0,25 балла, за 2 термина – 0,5 баллов, за три – 0,75 баллов.</h4>
    <router-link to="/">Home</router-link>
    <hr>
    <Questionnaire/>
  </div>
</template>
<script>
import Questionnaire from '@/components/taks3/Questionnaire'

export default {
  name: 'App',
  components: {
    Questionnaire
  }
}
</script>