<template>
  <div>
    <h3>Задание 1</h3>
    <h4>Предусмотреть две кнопки, первая из которых последовательно прокручивает шаблоны (templates) «Ф.И.О./Номер
      паспорта/Должность/Ставка», после чего становится недоступной и передаёт управление другой кнопке, становящейся
      доступной. Вторая кнопка, в свою очередь, прокручивает шаблоны «Ф.И.О./Номер паспорта/Должность/Ставка»
      последовательно в обратном порядке, становится недоступной и передаёт управление первой кнопке, которая ранее была
      заблокирована.
    </h4>
    <router-link to="/">Home</router-link>
    <hr>
    <EmployeeItems/>
  </div>
</template>
<script>
import EmployeeItems from '@/components/taks1/EmployeeItems'

export default {
  name: 'App',
  components: {
    EmployeeItems
  }
}
</script>